-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 28 2021 г., 10:24
-- Версия сервера: 5.6.51-log
-- Версия PHP: 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `phpadvanced`
--

-- --------------------------------------------------------

--
-- Структура таблицы `catalog`
--

CREATE TABLE `catalog` (
  `catalog_id` int(11) NOT NULL,
  `title` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `catalog`
--

INSERT INTO `catalog` (`catalog_id`, `title`, `description`, `price`) VALUES
(1, 'Товар 1', 'Описание 1', '101'),
(2, 'Товар 2', 'Описание 2', '102'),
(3, 'Товар 3', 'Описание 3', '103'),
(4, 'Товар 4', 'Описание 4', '104'),
(5, 'Товар 5', 'Описание 5', '105'),
(6, 'Товар 6', 'Описание 6', '106'),
(7, 'Товар 7', 'Описание 7', '107'),
(8, 'Товар 8', 'Описание 8', '108'),
(9, 'Товар 9', 'Описание 9', '109'),
(10, 'Товар 10', 'Описание 10', '1010'),
(11, 'Товар 11', 'Описание 11', '1011'),
(12, 'Товар 12', 'Описание 12', '1012'),
(13, 'Товар 13', 'Описание 13', '1013'),
(14, 'Товар 14', 'Описание 14', '1014'),
(15, 'Товар 15', 'Описание 15', '1015'),
(16, 'Товар 16', 'Описание 16', '1016'),
(17, 'Товар 17', 'Описание 17', '1017'),
(18, 'Товар 18', 'Описание 18', '1018'),
(19, 'Товар 19', 'Описание 19', '1019'),
(20, 'Товар 20', 'Описание 20', '1020'),
(21, 'Товар 21', 'Описание 21', '1021'),
(22, 'Товар 22', 'Описание 22', '1022'),
(23, 'Товар 23', 'Описание 23', '1023'),
(24, 'Товар 24', 'Описание 24', '1024'),
(25, 'Товар 25', 'Описание 25', '1025'),
(26, 'Товар 26', 'Описание 26', '1026'),
(27, 'Товар 27', 'Описание 27', '1027'),
(28, 'Товар 28', 'Описание 28', '1028'),
(29, 'Товар 29', 'Описание 29', '1029'),
(30, 'Товар 30', 'Описание 30', '1030'),
(31, 'Товар 31', 'Описание 31', '1031'),
(32, 'Товар 32', 'Описание 32', '1032'),
(33, 'Товар 33', 'Описание 33', '1033'),
(34, 'Товар 34', 'Описание 34', '1034'),
(35, 'Товар 35', 'Описание 35', '1035'),
(36, 'Товар 36', 'Описание 36', '1036'),
(37, 'Товар 37', 'Описание 37', '1037'),
(38, 'Товар 38', 'Описание 38', '1038'),
(39, 'Товар 39', 'Описание 39', '1039'),
(40, 'Товар 40', 'Описание 40', '1040'),
(41, 'Товар 41', 'Описание 41', '1041'),
(42, 'Товар 42', 'Описание 42', '1042'),
(43, 'Товар 43', 'Описание 43', '1043'),
(44, 'Товар 44', 'Описание 44', '1044'),
(45, 'Товар 45', 'Описание 45', '1045'),
(46, 'Товар 46', 'Описание 46', '1046'),
(47, 'Товар 47', 'Описание 47', '1047'),
(48, 'Товар 48', 'Описание 48', '1048'),
(49, 'Товар 49', 'Описание 49', '1049'),
(50, 'Товар 50', 'Описание 50', '1050'),
(51, 'Товар 51', 'Описание 51', '1051'),
(52, 'Товар 52', 'Описание 52', '1052'),
(53, 'Товар 53', 'Описание 53', '1053'),
(54, 'Товар 54', 'Описание 54', '1054'),
(55, 'Товар 55', 'Описание 55', '1055'),
(56, 'Товар 56', 'Описание 56', '1056'),
(57, 'Товар 57', 'Описание 57', '1057'),
(58, 'Товар 58', 'Описание 58', '1058'),
(59, 'Товар 59', 'Описание 59', '1059'),
(60, 'Товар 60', 'Описание 60', '1060'),
(61, 'Товар 61', 'Описание 61', '1061'),
(62, 'Товар 62', 'Описание 62', '1062'),
(63, 'Товар 63', 'Описание 63', '1063'),
(64, 'Товар 64', 'Описание 64', '1064'),
(65, 'Товар 65', 'Описание 65', '1065'),
(66, 'Товар 66', 'Описание 66', '1066'),
(67, 'Товар 67', 'Описание 67', '1067'),
(68, 'Товар 68', 'Описание 68', '1068'),
(69, 'Товар 69', 'Описание 69', '1069'),
(70, 'Товар 70', 'Описание 70', '1070'),
(71, 'Товар 71', 'Описание 71', '1071'),
(72, 'Товар 72', 'Описание 72', '1072'),
(73, 'Товар 73', 'Описание 73', '1073'),
(74, 'Товар 74', 'Описание 74', '1074'),
(75, 'Товар 75', 'Описание 75', '1075'),
(76, 'Товар 76', 'Описание 76', '1076'),
(77, 'Товар 77', 'Описание 77', '1077'),
(78, 'Товар 78', 'Описание 78', '1078'),
(79, 'Товар 79', 'Описание 79', '1079'),
(80, 'Товар 80', 'Описание 80', '1080'),
(81, 'Товар 81', 'Описание 81', '1081'),
(82, 'Товар 82', 'Описание 82', '1082'),
(83, 'Товар 83', 'Описание 83', '1083'),
(84, 'Товар 84', 'Описание 84', '1084'),
(85, 'Товар 85', 'Описание 85', '1085'),
(86, 'Товар 86', 'Описание 86', '1086'),
(87, 'Товар 87', 'Описание 87', '1087'),
(88, 'Товар 88', 'Описание 88', '1088'),
(89, 'Товар 89', 'Описание 89', '1089'),
(90, 'Товар 90', 'Описание 90', '1090'),
(91, 'Товар 91', 'Описание 91', '1091'),
(92, 'Товар 92', 'Описание 92', '1092'),
(93, 'Товар 93', 'Описание 93', '1093'),
(94, 'Товар 94', 'Описание 94', '1094'),
(95, 'Товар 95', 'Описание 95', '1095'),
(96, 'Товар 96', 'Описание 96', '1096'),
(97, 'Товар 97', 'Описание 97', '1097'),
(98, 'Товар 98', 'Описание 98', '1098'),
(99, 'Товар 99', 'Описание 99', '1099');

-- --------------------------------------------------------

--
-- Структура таблицы `gallery`
--

CREATE TABLE `gallery` (
  `image_id` int(11) NOT NULL,
  `title` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `path` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `gallery`
--

INSERT INTO `gallery` (`image_id`, `title`, `description`, `path`) VALUES
(1, 'Картинка 1', 'Описание 1', 'item1.png'),
(2, 'Картинка 2', 'Описание 2', 'item2.png'),
(3, 'Картинка 3', 'Описание 3', 'item3.png'),
(4, 'Картинка 4', 'Описание 4', 'item4.png'),
(5, 'Картинка 5', 'Описание 5', 'item5.png'),
(6, 'Картинка 6', 'Описание 6', 'item6.png'),
(7, 'Картинка 7', 'Описание 7', 'item7.png'),
(8, 'Картинка 8', 'Описание 8', 'item8.png');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `catalog`
--
ALTER TABLE `catalog`
  ADD PRIMARY KEY (`catalog_id`);

--
-- Индексы таблицы `gallery`
--
ALTER TABLE `gallery`
  ADD PRIMARY KEY (`image_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `catalog`
--
ALTER TABLE `catalog`
  MODIFY `catalog_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=100;

--
-- AUTO_INCREMENT для таблицы `gallery`
--
ALTER TABLE `gallery`
  MODIFY `image_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
